import "./TwoPointOne.css";
import png31 from "../images/png31.png";
import png32 from "../images/png32.png";
import png33 from "../images/png33.png";
import png34 from "../images/png34.png";
import png35 from "../images/png35.png";
import png36 from "../images/png36.png";
import png37 from "../images/png37.png";
import png38 from "../images/png38.png";
import png39 from "../images/png39.png";
import png40 from "../images/png40.png";
import png41 from "../images/png41.png";
import png42 from "../images/png42.png";
import png43 from "../images/png43.png";
import png44 from "../images/png44.png";
import png45 from "../images/png45.png";
import png46 from "../images/png46.png";
import png47 from "../images/png47.png";
import png48 from "../images/png48.png";

function TwoPointOne() {
    return (
        <div className="phtcPage">
        <div className="twoPointOne">
          <text className="SecondChapterTexts">
            <p>
              <b>Գծային հավասարումների համակարգեր</b>
            </p>
            <br />
            <img src={png31} alt="" />
            <br />
            <p>
              Համակարգը լուծենք տեղադրման եղանակով՝ առաջին հավասարումից գտնենք y-ը
              (արտահայտված x-ով), տեղադրենք երկրորդ հավասարման մեջ, կստանանք x-ով
              արտահայտված հավասարում, որտեղից կգտնենք x-ը, այնուհետև y-ը, կազմենք
              թվազույգ, որն էլ կլինի համակարգի լուծումը։
            </p>
            <br />
            <p>ա) Նկատի ունենանք վերը շարադրվածը։</p>
            <p>բ) Հանակարգը լուծելիս պահպանենք համարժեքության կանոնները։</p>
            <br />
            <img src={png32} alt="" />
            <br />
            <p>
              ա) (-10,5) թվազույգը բավարարում է համակարգի երկու հավասարումներին։
            </p>
            <br />
            <img src={png33} alt="" />
            <br />
            ուրիշ թվազույգ չկա, որ բավարարի համակարգի հավասարումներին։ Այս դեպքում
            կասենք համակարգը ունի միակ լուծում՝ (-10,5)։
            <br />
            <p>
              բ) Համակարգը հավասարումների բազմություն է, որտեղ խնդիր է դրվում
              գտնել փոփոխականների այն արժեքները, որոնք բավարարում են տրված
              հավասարումներից յուրաքանչյուրին (նույնը վերաբերվում է նաև
              անհավասարումների համակարգին)։
            </p>
            <img src={png34} alt="" />
            <br />
            <p>
              գ) Օրինակների միջոցով պարզաբանենք {`{`} նշանի իմաստը։ Դիցուք տրված
              է՝{" "}
            </p>
            <img src={png35} alt="" />
            <br />
            այսինքն այդ երկու թվային բազմությունների ընդհանոր թվերը (այդ
            բազմությունների հատումը) 2-ը և 3-ն են։
            <br />
            <img src={png36} alt="" />
            <br />
            <p>
              դ)Համակարգեր լուծելիս օգտագործվում է նաև {`[`} նշանը, որը նշանակում
              է երկու բազմությունների համախումբ կամ միավորում։ Համախումբը
              հավասարումների բազմություն է, որտեղ խնդիր է դրվում գտնել
              փոփոխականների այն արժեքները , որոնք բավարարում են տրված
              հավասարումներից գոնե մեկին (նույնը վերաբերվում է նաև
              անհավասարումներից կազմված համախմբին)։{" "}
            </p>
            <img src={png37} alt="" />
            <br />
            <img src={png38} alt="" />
            <br />
            <p>
              ե) Եթե համակարգիի հավասարումներից մեկը լուծում չունի, ապա համակարգը
              ևս լուծում չունի։
            </p>
            <img src={png39} alt="" />
            <br />
            <p>
              զ) Համակարգը լուծելիս ևս կպահպանենք համարժեքության կանոնները
              (հակառակ դեպքում պետք է կատարել ստուգում)։
            </p>
            <br />
            <img src={png40} alt="" />
            <br />
            <p>
              ը) <b>x2+3xy-7y2</b> տեսքի արտահայտությունը, որի բոլոր անդամները
              երկրորդ աստիճանի են, կոչվում է երկրորդ կարգի համասեռ
              արտահայտություն, իսկ
              <b>x2+3xy-7y2=0</b>-ն՝ համասեռ հավասարում։ Եթե համակարգը պարունակում
              է համասեռ հավասարում, ապա <b>y=xt</b> նշանակումը հեստացնում է
              համակարգի լուծումը։
            </p>
            <p>թ) Համակարգը լուծենք այլ եղանակով։</p>
            <img src={png41} alt="" />
            <br />
            <img src={png42} alt="" />
            <br />
            <img src={png43} alt="" />
            <br />
            <p>
              Առաջին հավասարումից z=8, մյուս հավասարումից y-ի ցանկացած արժեք
              բավարարում է երկրորդ հավասարմանը, այդ արժեքները 8-ի հետ կկազմեն
              թվազույգեր, որոնք կլինեն համակարգի լուծումները։ <b>(y,8),y∈R:</b>{" "}
            </p>
            <img src={png44} alt="" />
            <br />
            <img src={png45} alt="" />
            <br />
            <p>Այսպիսով՝</p>
            <img src={png46} alt="" />
            <br />
            <p>
              այսինքն համակարգը բերվեց երկու անհայտով մեկ հավասարման, որի
              լուծումն՝ x-ին տանք կամայական իրական արժեք, գտնենք y –ի արժեքը և
              կազմենք թվազույգ, որոնց քանակը կլինի անվերջ բազմությամբ։ Օրինակներ՝
            </p>
            <img src={png47} alt="" />
            <br />
            <p> և այլն։ Համակարգի անթիվ բազմությամբ լուծումները գրվում է՝</p>
            <br />
            <img src={png48} alt="" />
            <br />
          </text>
          </div>
          </div>
    )
}

export default TwoPointOne;